app/controllers/v1/greetings_controller.rb

  def index
    render json: {
      message: Greeting.all.sample
---
SELECT "greetings".* FROM "greetings"